# Movies Database: Transformations

by Israel Diaz

## Data Description

The data correspond to the one downloaded from [IMDB source](https://datasets.imdbws.com/).

**IMDb Dataset Details**

Each dataset is contained in a gzipped, tab-separated-values (TSV) formatted file in the UTF-8 character set. The first line in each file contains headers that describe what is in each column. A ‘\N’ is used to denote that a particular field is missing or null for that title/name. The available datasets are as follows:

**title.akas.tsv.gz** - Contains the following information for titles:

* titleId (string) - a tconst, an alphanumeric unique identifier of the title
* ordering (integer) – a number to uniquely identify rows for a given titleId
* title (string) – the localized title
* region (string) - the region for this version of the title
* language (string) - the language of the title
* types (array) - Enumerated set of attributes for this alternative title. One or more of the following: "alternative", "dvd", "festival", "tv", "video", "working", "original", "imdbDisplay". New values may be added in the future without warning
* attributes (array) - Additional terms to describe this alternative title, not enumerated
* isOriginalTitle (boolean) – 0: not original title; 1: original title

**title.basics.tsv.gz** - Contains the following information for titles:

* tconst (string) - alphanumeric unique identifier of the title
* titleType (string) – the type/format of the title (e.g. movie, short, tvseries, tvepisode, video, etc)
* primaryTitle (string) – the more popular title / the title used by the filmmakers on promotional materials at the point of release
* originalTitle (string) - original title, in the original language
* isAdult (boolean) - 0: non-adult title; 1: adult title
* startYear (YYYY) – represents the release year of a title. In the case of TV Series, it is the series start year
* endYear (YYYY) – TV Series end year. ‘\N’ for all other title types
* runtimeMinutes – primary runtime of the title, in minutes
* genres (string array) – includes up to three genres associated with the title

**title.ratings.tsv.gz** – Contains the IMDb rating and votes information for titles

* tconst (string) - alphanumeric unique identifier of the title
* averageRating – weighted average of all the individual user ratings
* numVotes - number of votes the title has received

## Data Transformation

I will create a new MySQL database after preparing the data for a relational database. I will export your database to a .sql file in your repository using MySQL Workbench.

### Load Libraries

In [1]:
## General Libraries
import pandas as pd
import numpy as np
import warnings
warnings.simplefilter('ignore')
import os, time,json

## database handling
from sqlalchemy.types import *
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

## specifying data folder
FOLDER = "data/"
os.makedirs(FOLDER, exist_ok=True)
os.listdir(FOLDER)

['basics.csv.gz',
 'aka.csv.gz',
 'ratings.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'tmdb_api_results_2000.json',
 'tmdb_api_results_2001.json',
 'tmdb_results_combined.csv.gz',
 'mod',
 'backup_data']

In [2]:
## Connecting to de SQL database
username = "root"
password = "****" # password was hidden for security reasons
db_name = "project_movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [3]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
    create_database(connection)
else:
    print('The database already exists')

The database already exists

In [4]:
## creating mysql engine
engine = create_engine(connection)

### Loading Data

#### Title_Basics

In [5]:
title_basics = pd.read_csv(filepath_or_buffer='data/basics.csv.gz')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

#### Title genres

In [6]:
## create a dataframe with only tconst and genres variable.
subset_basics = title_basics[['tconst', 'genres']].copy()

## Transform genres column
subset_basics['genres_split'] = subset_basics['genres'].str.split(',')

## separate list of genres.
exploded_genres = subset_basics.explode('genres_split')
exploded_genres.head(10)

      tconst                  genres genres_split
0  tt0035423  Comedy,Fantasy,Romance       Comedy
0  tt0035423  Comedy,Fantasy,Romance      Fantasy
0  tt0035423  Comedy,Fantasy,Romance      Romance
1  tt0062336                   Drama        Drama
2  tt0069049                   Drama        Drama
3  tt0088751    Comedy,Horror,Sci-Fi       Comedy
3  tt0088751    Comedy,Horror,Sci-Fi       Horror
3  tt0088751    Comedy,Horror,Sci-Fi       Sci-Fi
4  tt0096056                   Drama        Drama
5  tt0100275    Comedy,Drama,Fantasy       Comedy

In [7]:
## list of unique genres
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [8]:
## create title_genres table
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head(10)

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama
3  tt0088751       Comedy
3  tt0088751       Horror
3  tt0088751       Sci-Fi
4  tt0096056        Drama
5  tt0100275       Comedy

In [9]:
## Mapping genres to integers
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
##showing results
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [10]:
## replacing genres string with integers
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

## Show results
title_genres.head(10)

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7
3  tt0088751         5
3  tt0088751        12
3  tt0088751        19
4  tt0096056         7
5  tt0100275         5

#### genres

In [11]:
## convert genre_map into a dataframe
genres = pd.DataFrame({'genre_mame': genre_map.keys(),
                       'genre_id': genre_map.values()})

genres.head(10)

  genre_mame  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4
5     Comedy         5
6      Crime         6
7      Drama         7
8     Family         8
9    Fantasy         9

#### Drop unnecessary columns from title_basics

In order to meet the standards of SQL database normalization and the requirements of the stakeholders, I will drop the unnecessary columns from title basics

In [12]:
title_basics.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres'],
      dtype='object')

In [13]:
drop_basics = ['titleType', 'originalTitle', 'isAdult', 'genres']
title_basics.drop(columns=drop_basics, axis=1, inplace=True)

##show results
title_basics.head(10)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0088751,The Naked Monster,2005,NaN,100
4,tt0096056,Crime and Punishment,2002,NaN,126
5,tt0100275,The Wandering Soap Opera,2017,NaN,80
6,tt0103340,Life for Life: Maximilian Kolbe,2006,NaN,90
7,tt0108549,West from North Goes South,2004,NaN,96
8,tt0113026,The Fantasticks,2000,NaN,86
9,tt0113092,For the Cause,2000,NaN,100

#### Export title_basics, title_genres and genres to sql

I will need to find the max length of the object column as it will be the primary key and is a string type column

In [14]:
### FOR TITLE_BASICS
## Max string lengths for object columns
tb_key_len = title_basics['tconst'].fillna('').map(len).max()
tb_title_len = title_basics['primaryTitle'].fillna('').map(len).max()

## Create a schema dictonary for sqlalchemy
title_basics_schema = {
    "tconst": String(tb_key_len+1),
    "primaryTitle": Text(tb_title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [15]:
# Save to sql with dtype and index=False
title_basics.to_sql('title_basics',engine,dtype=title_basics_schema,if_exists='replace',index=False)

85575

In [16]:
## Execute query ADD PRIMARY KEY
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

Show title_basic query

In [17]:
q = '''
    SELECT *
    FROM title_basics
    LIMIT 5;
'''

pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0096056,Crime and Punishment,2002.0,None,126

In [18]:
### FOR TITLE_GENRES
tg_key_len = title_genres['tconst'].fillna('').map(len).max()

## Create a schema dictonary for sqlalchemy
title_genres_schema = {
    "tconst": String(tg_key_len+1),
    'genre_id':Integer()}

In [19]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=title_genres_schema,if_exists='replace',index=False)

159854

Show title_genres query

In [20]:
q = '''
    SELECT *
    FROM title_genres
    LIMIT 5;
'''

pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [21]:
### FOR GENRES
g_key_len = genres['genre_mame'].fillna('').map(len).max()

## Create a schema dictonary for sqlalchemy
genres_schema = {
    "genre_mame": String(g_key_len+1),
    'genre_id':Integer()}

In [22]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=genres_schema,if_exists='replace',index=False)

26

In [23]:
## Execute query ADD PRIMARY KEY
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

Show genres query

In [24]:
q = '''
    SELECT *
    FROM genres
    LIMIT 5;
'''

pd.read_sql(q, engine)

  genre_mame  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### Title Rating

In [25]:
title_rating = pd.read_csv(filepath_or_buffer='data/ratings.csv.gz')
title_rating.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1953
1  tt0000002            5.8       263
2  tt0000005            6.2      2589
3  tt0000006            5.1       177
4  tt0000007            5.4       812

#### Exporting to SQL

In [26]:
### FOR TITLE_RATING
## Max string lengths for object columns
tr_key_len = title_rating['tconst'].fillna('').map(len).max()

## Create a schema dictonary for sqlalchemy
title_rating_schema = {
    "tconst": String(tr_key_len+1),
    'averageRating':Float(),
    'numVotes':Integer()}

In [27]:
# Save to sql with dtype and index=False
title_rating.to_sql('title_rating',engine,dtype=title_rating_schema,if_exists='replace',index=False)

489933

Show title_rating query

In [28]:
q = '''
    SELECT *
    FROM title_rating
    LIMIT 5;
'''

pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1953
1  tt0000002            5.8       263
2  tt0000005            6.2      2589
3  tt0000006            5.1       177
4  tt0000007            5.4       812

### tmdb_data transformation

In [29]:
tmdb_data = pd.read_csv(filepath_or_buffer='data/tmdb_results_combined.csv.gz')
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.112,2138.0,PG

In [30]:
tmdb_data = tmdb_data[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb_data.columns = ['tconst', 'revenue', 'budget', 'certification']
tmdb_data.head()

      tconst     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

There are zeros in tconst column

In [31]:
tmdb_data[tmdb_data.duplicated()]

     tconst  revenue  budget certification
1222      0      NaN     NaN           NaN

I will delete those zeros, they are product of the import of the files in the previous steps

In [32]:
tmdb_data = tmdb_data[tmdb_data['tconst'] != '0']

#### Export to SQL

In [33]:
### FOR TMDB
## Max string lengths for object columns
tmdb_key_len = tmdb_data['tconst'].fillna('').map(len).max()
tmdb_mpaa_len = tmdb_data['certification'].fillna('').map(len).max()

## Create a schema dictonary for sqlalchemy
tmdb_data_schema = {
    "tconst": String(tmdb_key_len+1),
    'revenue':Float(),
    'budget':Integer(),
    'certification':Text(tmdb_mpaa_len+1)}

In [34]:
# Save to sql with dtype and index=False
tmdb_data.to_sql('tmdb_data',engine,dtype=tmdb_data_schema,if_exists='replace',index=False)

2518

Show tmdb_data query

In [35]:
q = '''
    SELECT *
    FROM tmdb_data
    LIMIT 5;
'''

pd.read_sql(q, engine)

      tconst     revenue    budget certification
0  tt0113026         0.0  10000000          None
1  tt0113092         0.0         0          None
2  tt0116391         0.0         0          None
3  tt0118694  12855000.0    150000            PG
4  tt0118852         0.0         0             R

### SHOW TABLES

In [36]:
q = '''
    SHOW TABLES
'''

pd.read_sql(q, engine)

  Tables_in_project_movies
0                   genres
1             title_basics
2             title_genres
3             title_rating
4                tmdb_data

## ERD

![png](erd_movies.png)